# Дана строка s = 'bfgshbkis'
# Преобразовать её в строку 'ibs', используя оператор извлечения среза только один раз.

word = 'bfgshbkis'
print(word[7:2:-2])
