# 1. Открыть страницу http://google.com/ncr
# 2. Выполнить поиск слова 'selenide'
# 3. Проверить, что первый результат – ссылка на сайт selenide.org.
# 4. Перейти в раздел поиска изображений
# 5. Проверить, что первое изображение неким образом связано с сайтом
# selenide.org.
# 6. Вернуться в раздел поиска Все
# 7. Проверить, что первый результат такой же, как и на шаге 3.
# Если с гуглом будут проблемы, можно выбрать любой другой поисковик.
# Браузер - по своему выбору. Стандартно
# селениум разработан под Firefox, но также стабильно работает по Chrome.
